Reports/ПрайсВыгрузкаВЕксель.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Report>
		<Properties>
			<Name>ПрайсВыгрузкаВЕксель</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/ШтрихкодыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ШтрихкодыНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Партнеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Catalog>
		<Properties>
			<Name>Партнеры</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БизнесРегион</Name>
					<Comment>Используется для группировки по территориальному признаку</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БизнесРегионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаПартнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Comment>Используется при анализе первичного интереса</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Comment>Клиенты</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Comment>Поставщики</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Публичное наименование, например, для печати или устного обращения.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конкурент</Name>
					<Comment>Конкуренты</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрочиеОтношения</Name>
					<Comment>Прочие отношения</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбслуживаетсяТорговымиПредставителями</Name>
					<Comment>Обслуживаются торговыми представителями</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Comment>Перевозчики</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЭтикетки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныЭтикетокИЦенников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КомпанияЧастноеЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитАртикула</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольМП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РелизМП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПереработчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтправкиЭлектронногоЧека</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОтправкиЭлектронногоЧекаПокупателю</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/ПрайсВыгрузкаВЕксель/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ТабДок, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	УстановитьПривилегированныйРежим(Истина);
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,
	Настройки,ДанныеРасшифровки,,
	Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных);

	ПроцессорВывода 	= Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТаблицаРезультата 	= Новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаРезультата);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Макет 				= ПолучитьМакет("Макет");
	ОблШапкаКатегория 	= Макет.Получитьобласть("Шапка|ОбластьКатегория");
	ОблСтрокаКатегория 	= Макет.Получитьобласть("Строка|ОбластьКатегория");
	ОблШапка 			= Макет.Получитьобласть("Шапка|ОбластьОкончание");
	ОблСтрока 			= Макет.Получитьобласть("Строка|ОбластьОкончание");
	
	ОблШапкаРекв 			= Макет.Получитьобласть("Шапка|ОбластьРеквизит");
	ОблСтрокаРекв 			= Макет.Получитьобласть("Строка|ОбластьРеквизит");
	
	//ТабДок = Новый ТабличныйДокумент;
	Параметр = Настройки.ПараметрыДанных.Элементы.Найти("ВыгружатьСтруктуруКаталога"); 
	ВыгружатьСтруктуруКаталога 	= Параметр.Значение;
	
	Параметр = Настройки.ПараметрыДанных.Элементы.Найти("ДопРеквизиты"); 
		
	Если ТипЗнч(Параметр.Значение) = Тип("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения") Тогда
		ДопРеквизиты                = Новый СписокЗначений;
		ДопРеквизиты.Добавить(Параметр.Значение);
	Иначе	
		ДопРеквизиты 				= Параметр.Значение;
	КонецЕсли;
	Параметр = Настройки.ПараметрыДанных.Элементы.Найти("ИспользоватьОбщиеОстатки");
	ИспользоватьОбщиеОстатки 	= Параметр.Значение;
	
	Параметр = Настройки.ПараметрыДанных.Элементы.Найти("ИспользоватьОстаткиПоставщика");
	ИспользоватьОстаткиПоставщика = Параметр.Значение;
	
	Параметр = Настройки.ПараметрыДанных.Элементы.Найти("СоединятьНоменклатуру");
	СоединятьНоменклатуру = Параметр.Значение;
	
	Если ВыгружатьСтруктуруКаталога Тогда
		//Кожемякин А.Г. agkozhemyakin@gmail.com {
		//17.07.2014 22:03:00
		//получим максимальное количество подкаталогов
		КоличествоПодкаталогов = 0;
		КаталогТовара          = Новый Массив;
		//Пока Результат.Следующий() Цикл
		Для Каждого Результат из ТаблицаРезультата Цикл
			Если КаталогТовара.Найти(Результат.Номенклатура.Родитель) = Неопределено Тогда
				КаталогТовара = ПолучитьРодителяТовара(Результат.Номенклатура);
				Если КоличествоПодкаталогов < КаталогТовара.Количество() Тогда
					КоличествоПодкаталогов = КаталогТовара.Количество();
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;	
		//}Кожемякин А.Г.
		Для Индекс = 0 По КоличествоПодкаталогов Цикл
			Если Индекс = 0 Тогда
				ОблШапкаКатегория.Параметры.НаименованиеКолонки = "Категория";
				ТабДок.Вывести(ОблШапкаКатегория);
			Иначе
				ОблШапкаКатегория.Параметры.НаименованиеКолонки = "Подкатегория"+Индекс;
				ТабДок.Присоединить(ОблШапкаКатегория);
			КонецЕсли;
		КонецЦикла;
		ТабДок.Присоединить(ОблШапка);
	Иначе
		ТабДок.Вывести(ОблШапка);
	КонецЕсли;
	
	Для Каждого СтрокаРеквизиты из ДопРеквизиты Цикл
		//Если СтрокаРеквизиты.Выгружать Тогда
			ОблШапкаРекв.Параметры.ИмяРеквизит = ""+СтрокаРеквизиты.Значение;
			ТабДок.Присоединить(ОблШапкаРекв);	
		//КонецЕсли;	
	КонецЦикла;
	//
	////Результат.Сбросить();
	////Пока Результат.Следующий() Цикл 
	Для Каждого Результат из ТаблицаРезультата Цикл
		Если ВыгружатьСтруктуруКаталога Тогда
			КаталогТовара = ПолучитьРодителяТовара(Результат.Номенклатура);
			Для Индекс = 0 По КоличествоПодкаталогов Цикл
				Если Индекс > КаталогТовара.Количество() Тогда
					ОблСтрокаКатегория.Параметры.НаименованиеКатегории = "";
					ТабДок.Присоединить(ОблСтрокаКатегория);
				ИначеЕсли Индекс = 0 Тогда
					ОблСтрокаКатегория.Параметры.НаименованиеКатегории = "Номенклатура";
					ТабДок.Вывести(ОблСтрокаКатегория);
				Иначе
					ОблСтрокаКатегория.Параметры.НаименованиеКатегории = КаталогТовара.Получить(КаталогТовара.Количество()-(Индекс));
					ТабДок.Присоединить(ОблСтрокаКатегория);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;                                              
		ОблСтрока.параметры.Заполнить(Результат);
		
		ОблСтрока.параметры.Цена = Формат(Результат.Цена, "ЧГ=0");
		ОблСтрока.параметры.Цена2 = Формат(Результат.Цена2, "ЧГ=0");
		
		Если ИспользоватьОстаткиПоставщика Тогда
			ОблСтрока.Параметры.Количество = Формат(Результат.ОстатокПоставщика, "ЧГ=0");	
		КонецЕсли;
		
		Если ИспользоватьОбщиеОстатки Тогда
			ОблСтрока.Параметры.Количество = Формат(Результат.ОстатокПоставщика + Результат.Количество, "ЧГ=0");
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(Результат.Характеристика) 
			и СоединятьНоменклатуру Тогда
			ОблСтрока.Параметры.Наименование 	= Результат.Наименование + ", " + СокрЛП(СтрЗаменить(Результат.Характеристика,"Цвет-","")); 
			ОблСтрока.Параметры.Описание 		= Результат.Описание + ", " + СокрЛП(СтрЗаменить(Результат.Характеристика,"Цвет-","")); 
		КонецЕсли;
		
		ШтрихКод 						= дп_ДополнительныеПроцедуры.ПолучитьШтрихКодНоменклатуры(Результат.Номенклатура, Результат.ХарактеристикаСсылка);
		ОблСтрока.параметры.Штрихкод 	= ШтрихКод;
	//	//ОблСтрока.параметры.СсылкаФото1 = ПолучитьЗначениеДопРеквизита(Результат.ХарактеристикаСсылка,1);
	//	//ОблСтрока.параметры.СсылкаФото2 = ПолучитьЗначениеДопРеквизита(Результат.ХарактеристикаСсылка,2);
	//	
	//	//Характ = ""+Результат.характеристика;
	//	//Характ1 = СтрЗаменить(Характ,"Цвет -","");
	//	//Характ2 = СтрЗаменить(Характ1,"Цвет-","");
	//	//Характ3 = СтрЗаменить(Характ2,"цвет -","");
	//	//Характ4 = СтрЗаменить(Характ3,"цвет-","");
	//	//ОблСтрока.параметры.характеристика = СокрЛП(Характ4);
		Если ВыгружатьСтруктуруКаталога Тогда
			ТабДок.Присоединить(ОблСтрока);
		Иначе
			ТабДок.Вывести(ОблСтрока);
		КонецЕсли;
		
		ТипБулево = Новый ОписаниеТипов("Булево");
		
		Для Каждого СтрокаРеквизиты из ДопРеквизиты Цикл
			//Если СтрокаРеквизиты.Выгружать Тогда
				ТекЗначениеРеквизита = Неопределено;
				
				ЗначениеРеквизита = Результат.Номенклатура.ДополнительныеРеквизиты.Найти(СтрокаРеквизиты.Значение, "Свойство");
				Если Не ЗначениеРеквизита = Неопределено Тогда
					ТекЗначениеРеквизита 	= ЗначениеРеквизита.Значение;
				КонецЕсли;	
					
				Если ТекЗначениеРеквизита = Неопределено Тогда
					ЗначениеРеквизита = Результат.ХарактеристикаСсылка.ДополнительныеРеквизиты.Найти(СтрокаРеквизиты.Значение, "Свойство");
					Если Не ЗначениеРеквизита = Неопределено Тогда
						ТекЗначениеРеквизита 	= ЗначениеРеквизита.Значение;
					КонецЕсли;
				КонецЕсли;
				
				Если ТекЗначениеРеквизита = Неопределено Тогда
					ЗначениеРеквизита = РегистрыСведений.ДополнительныеСведения.Получить(Новый Структура("Объект, Свойство", Результат.Номенклатура, СтрокаРеквизиты.Значение));
					Если ЗначениеЗаполнено(ЗначениеРеквизита.Значение) Тогда
						Если СтрокаРеквизиты.Значение.ТипЗначения = ТипБулево 
							и ЗначениеРеквизита.Значение = Истина ТОГДА
							ТекЗначениеРеквизита 	= СтрокаРеквизиты.Значение.Подсказка;
						Иначе	
							ТекЗначениеРеквизита 	= ЗначениеРеквизита.Значение;
						КонецЕсли;	
					КонецЕсли;	
				КонецЕсли;
				
				Если ТекЗначениеРеквизита = Неопределено Тогда
					ЗначениеРеквизита = РегистрыСведений.ДополнительныеСведения.Получить(Новый Структура("Объект, Свойство", Результат.ХарактеристикаСсылка, СтрокаРеквизиты.Значение));
					Если ЗначениеЗаполнено(ЗначениеРеквизита.Значение) Тогда
						Если СтрокаРеквизиты.Значение.ТипЗначения = ТипБулево 
							и ЗначениеРеквизита.Значение = Истина ТОГДА
							ТекЗначениеРеквизита 	= СтрокаРеквизиты.Значение.Подсказка;
						Иначе	
							ТекЗначениеРеквизита 	= ЗначениеРеквизита.Значение;
						КонецЕсли;	
					КонецЕсли;	
				КонецЕсли;
				
				Если Не ТекЗначениеРеквизита = Неопределено Тогда
					ОблСтрокаРекв.Параметры.ЗначениеРеквизита 	= ТекЗначениеРеквизита;
				Иначе
					ОблСтрокаРекв.Параметры.ЗначениеРеквизита 	= "";
				КонецЕсли;
				
				ТабДок.Присоединить(ОблСтрокаРекв);	
			//КонецЕсли;	
		КонецЦикла;
		
	КонецЦикла;
	
	//ДокументРезультат = ТабДок;
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

&НаСервере
Функция ПолучитьРодителяТовара(Номенклатура)

	Результат 	= Новый Массив;
	ТекРодитель = Номенклатура.Родитель;
	
	Пока ЗначениеЗаполнено(ТекРодитель) Цикл
		Результат.Добавить(ТекРодитель);
		ТекРодитель = ТекРодитель.Родитель;
	КонецЦикла;
	
	Возврат Результат;

КонецФункции // ПолучитьРодителяТовара()

// <Описание функции>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаСервере
Функция ПолучитьЗначениеДопРеквизита(Характеристика, НомерСсылки = 1)

	Результат = "";
	Если ЗначениеЗаполнено(Характеристика) Тогда
		
		Для каждого ДопРеквизит Из Характеристика.ДополнительныеРеквизиты Цикл
			
			Если СокрЛП(ДопРеквизит.Свойство.Наименование) = "ссылка на фото №1" 
				и НомерСсылки = 1 Тогда
				
				Результат = ДопРеквизит.Значение;
			ИначеЕсли СокрЛП(ДопРеквизит.Свойство.Наименование) = "ссылка на фото №2" 
				и НомерСсылки = 2 Тогда
				
				Результат = ДопРеквизит.Значение;	
			КонецЕсли; 	
			
		КонецЦикла;
		
	КонецЕсли; 

	
	
	Возврат Результат;
КонецФункции // ()

&НаСервере
Функция ПолучитьШтрихКодНоменклатуры(Номенклатура, Характеристика)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШтрихкодыНоменклатуры.Штрихкод
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|ГДЕ
		|	ШтрихкодыНоменклатуры.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
		|	И ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура
		|	И ШтрихкодыНоменклатуры.Характеристика = &Характеристика";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);	
	Запрос.УстановитьПараметр("Характеристика", Характеристика);	

	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат "";
	КонецЕсли;	

	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Штрихкод;
       	
КонецФункции
